{
  "john-piper-devotional": {
    "2017/01/01": {
      "content":
        "By the grace of God I am what I am, and his grace toward me was not in vain. On the contrary, I worked harder than any of them, though it was not I, but the grace of God that is with me. (1 Corinthians 15:10)\nGrace is not only God’s disposition to do good for us when we don’t deserve it. It is an actual power from God that acts and makes good things happen in us and for us.\nGod’s grace was God’s acting in Paul to make Paul work hard. So when Paul says, “Work out your salvation,” he adds, “it is God who works in you, both to will and to work for his good pleasure” (Philippians 2:13). Grace is power from God to do good things in us and for us.\nThis grace is past and it is future. It is ever cascading over the infinitesimal waterfall of the present from the inexhaustible river of grace coming to us from the future into the ever-increasing reservoir of grace in the past.\nIn the next five minutes, you will receive sustaining grace flowing to you from the future, and you will accumulate another five minutes’ worth of grace in the reservoir of the past. The proper response to grace you experienced in the past is gratitude, and the proper response to grace promised to you in the future is faith. We are thankful for the past grace of the last year, and we are confident in future grace for the new year.",
      "title": "Grace for the New Year"
    },
    "2017/01/03": {
      "content":
        "It depends not on human will or exertion, but on God, who has mercy. (Romans 9:16)\nLet us make crystal clear at the beginning of the year that all we will get from God this year as believers in Jesus is mercy. Whatever pleasures or pains come our way will all be mercy.\nThis is why Christ came into the world — “in order that the Gentiles might glorify God for his mercy” (Romans 15:9). We were born again “according to his great mercy” (1 Peter 1:3). We pray daily “that we may receive mercy” (Hebrews 4:16); and we are now “waiting for the mercy of our Lord Jesus Christ that leads to eternal life” (Jude 1:21). If any Christian proves trustworthy, it is “by the Lord's mercy [he] is trustworthy” (1 Corinthians 7:25).\nIn Luke 17:5, the apostles plead with the Lord, “Increase our faith!” And Jesus says, “If you had faith like a grain of mustard seed, you could say to this mulberry tree, ‘Be uprooted and planted in the sea,’ and it would obey you” (Luke 17:6). In other words, the issue in your Christian life and ministry is not the strength or quantity of your faith, because that is not what uproots trees. God does. Therefore, the smallest faith that truly connects you with Christ will engage enough of his power for all you need.\nBut what about your successes? Does your obedience move you out of the category of supplicant of mercy? Jesus gives the answer in the following verses of Luke 17:7–10.\nWill any one of you who has a servant plowing or keeping sheep say to him when he has come in from the field, “Come at once and sit down at table”? Will he not rather say to him, “Prepare supper for me, and dress properly, and serve me while I eat and drink, and afterward you will eat and drink”? Does he thank the servant because he did what was commanded? So you also, when you have done all that you were commanded, say, “We are unworthy servants; we have only done what was our duty.”\nTherefore, I conclude, the fullest obedience and the smallest faith obtain the same thing from God: mercy. A mere mustard seed of faith taps into the mercy of tree-moving power. And flawless obedience leaves us utterly dependent on mercy.\nThe point is this: Whatever the timing or form of God’s mercy, we never rise above the status of beneficiaries of mercy. We are always utterly dependent on the undeserved.\nTherefore let us humble ourselves and rejoice and “glorify God for his mercy”!",
      "title": "The Smallest Faith"
    },
    "2017/01/02": {
      "content":
        "Just as it is appointed for man to die once, and after that comes judgment, so Christ, having been offered once to bear the sins of many, will appear a second time, not to deal with sin but to save those who are eagerly waiting for him. (Hebrews 9:27-28)\nThe death of Jesus bears sins. This is the very heart of Christianity and the heart of the gospel and the heart of God's great work of redemption in the world. When Christ died he bore sins. He took sins not his own. He suffered for sins that others had done, so that they could be free from sins.\nThis is the answer to the greatest problem in your life, whether you feel it as the main problem or not. There is an answer to how we can get right with God in spite of being sinners. The answer is that Christ’s death is “an offering to bear the sins of many.” He lifted our sins and carried them to the cross and died there the death that I deserved to die.\nNow what does this mean for my dying? “It is appointed [to me] once to die.” It means that my death is no longer punitive. My death is no longer a punishment for sin. My sin has been borne away. My sin is “put away” by the death of Christ. Christ took the punishment.\nWhy then do I die at all? Because God wills that death remain in the world, even among his own children, as an abiding testimony to the extreme horror of sin. In our dying we still manifest the external effects of sin in the world.\nBut death for God’s children is no longer his wrath against them. It has become our entrance into salvation not condemnation.",
      "title": "What Jesus Did to Death"
    },
    "2017/01/05": {
      "content":
        "You, who were dead in your trespasses and the uncircumcision of your flesh, God made alive together with him, having forgiven us all our trespasses, by canceling the record of debt that stood against us with its legal demands. This he set aside, nailing it to the cross. He disarmed the rulers and authorities and put them to open shame, by triumphing over them in him. (Colossians 2:13–15)\nThe reason that union with Christ makes a great difference for the believer is that Christ achieved a decisive triumph over the devil at Calvary. He did not remove Satan from the world, but he disarmed him to the extent that the weapon of damnation was stripped from his hand.\nHe cannot accuse believers of unforgiven sin. And therefore, he cannot bring them to utter ruin. He can hurt them physically and emotionally, even kill them. He can tempt them and incite others against them. But he cannot destroy them.\nThe decisive triumph of Colossians 2:13–15 is owing to “the record of debt that stood against us” being nailed to the cross. The devil made that record his chief accusation against us. Now he has no accusation that holds. He is helpless to do the one thing he wants most to do — damn us. He can’t. Christ bore our damnation. The devil is disarmed.\nAnother way to say it is in Hebrews 2:14–15: “[Christ became human] that through death he might destroy the one who has the power of death, that is, the devil, and deliver all those who through fear of death were subject to lifelong slavery.”\nDeath is still our enemy. But it is defanged. The sting is gone. The sting of death was sin. And the damning power of sin was in the demand of the law. But thanks be to Christ who satisfied the law’s demand (1 Corinthians 15:56–57).",
      "title": "Our Toothless Enemy"
    },
    "2017/01/04": {
      "content":
        "By a single offering he has perfected for all time those who are being sanctified. (Hebrews 10:14)\nThis verse is full of encouragement for imperfect sinners like us, and full of motivation for holiness.\nIt means that you can have assurance that you stand perfected and completed in the eyes of your heavenly Father not because you are perfect now, but precisely because you are not perfect now but are “being sanctified,” “being made holy” — that, by faith in God’s promises, you are moving away from your lingering imperfection toward more and more holiness.\nDoes your faith make you eager to forsake sin and make progress in holiness? That is the kind of faith that in the midst of imperfection can look to Christ and say: “You have already perfected me in your sight.”\nThis faith says, “Christ, today I have sinned. But I hate my sin. For you have written the law on my heart, and I long to do it. And you are working in me what is pleasing in your sight. And so I hate the sin that I still do, and the sinful thoughts that I contemplate.”\nThis is the true and realistic faith that saves. It is not the boast of the strong. It is the cry of the weak in need of a Savior.\nI invite you and urge you to be weak enough to trust Christ in this way.",
      "title": "Hope for Imperfect People"
    }
  }
}
